БухЭксп/InformationRegisters/CW_ПараметрыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_РеестрыНДС0ЯчейкиПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_РеестрыНДС0ЯчейкиПриложений</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>150</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаНумерации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПоВидуТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеСтроки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПримечание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/CommonModules/CW_РеестрыНДС0Сервер/Ext/Module.bsl
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса, УстановленныеПараметры) Экспорт

	РеестрыНДС0Используется = ПолучитьФункциональнуюОпцию("CW_РеестрыНДС0Используется");
	УстановитьПараметрСеансаРеестрыНДС0(НЕ РеестрыНДС0Используется); 
	
	УстановленныеПараметры.Добавить("CW_РеестрыНДС0_ПоказатьРекламныйБаннерВДокументе");
	
КонецПроцедуры

// Заполняет основные сведения о библиотеке или основной конфигурации.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя подсисетмы, например, "CW_БухгалтерияЭкспедитора".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
Процедура ПриДобавленииПодсистем(ОписаниеПодсистем) Экспорт
	
	ОписаниеПодсистем.Вставить("CW_РеестрыНДС0", "8.3.12.2");
	
КонецПроцедуры  

Функция ПолучитьИдентификаторПрофиляГруппыДоступа() Экспорт

	Возврат Новый УникальныйИдентификатор("9150fcf5-1914-466e-8b8f-415e2dbbfdb6");
	
КонецФункции  

Процедура ОбновитьПрофилиПользователей(ПараметрыПроцедуры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьФункциональнуюОпцию("CW_РеестрыНДС0Используется") Тогда  
		
		Модуль_CW_РеестрыНДС0Сервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_РеестрыНДС0Сервер");
		Профиль = Модуль_CW_РеестрыНДС0Сервер.СоздатьПрофильДоступа();
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрСведенийCW_ПараметрыПользователей.Пользователь КАК Пользователь,
		|	ЕСТЬNULL(ГруппыДоступа.Ссылка, НЕОПРЕДЕЛЕНО) КАК ПерсональнаяГруппаДоступа
		|ИЗ
		|	РегистрСведений.CW_ПараметрыПользователей КАК РегистрСведенийCW_ПараметрыПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|		ПО РегистрСведенийCW_ПараметрыПользователей.Пользователь = ГруппыДоступа.Пользователь
		|			И (ГруппыДоступа.Профиль = &Профиль)
		|ГДЕ
		|	РегистрСведенийCW_ПараметрыПользователей.Группа = &Группа"; 
		
		Запрос.УстановитьПараметр("Группа", 	ПараметрыПроцедуры.ГруппаПользователей);
		Запрос.УстановитьПараметр("Профиль", 	Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл  
			
			Если ЗначениеЗаполнено(Выборка.ПерсональнаяГруппаДоступа) тогда
				ОбъектГруппаДоступа = Выборка.ПерсональнаяГруппаДоступа.ПолучитьОбъект();
				ОбъектГруппаДоступа.ПометкаУдаления = Ложь;   
			Иначе
				ОбъектГруппаДоступа = Справочники.ГруппыДоступа.СоздатьЭлемент();
				ОбъектГруппаДоступа.Родитель     	= Справочники.ГруппыДоступа.РодительПерсональныхГруппДоступа();
				ОбъектГруппаДоступа.Наименование 	= "Сервис ""Реестры НДС 0%""";
				ОбъектГруппаДоступа.Профиль 		= Профиль;
				ОбъектГруппаДоступа.Пользователь 	= Выборка.Пользователь;
				ОбъектГруппаДоступа.Комментарий 	= "Обеспечивает доступ к данным сервиса ""Реестры НДС 0%""";    
			КонецЕсли; 
			
			ОбъектГруппаДоступа.Пользователи.Очистить(); 
			
			Если ПараметрыПроцедуры.РеестрыНДС0 Тогда
				ОбъектГруппаДоступа.Пользователи.Добавить().Пользователь = Выборка.Пользователь;
			КонецЕсли;	
			
			ОбъектГруппаДоступа.Записать();
			
		КонецЦикла;   

	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьПрофильДоступа() Экспорт
	
	ИдентификаторПрофиля = CW_РеестрыНДС0Сервер.ПолучитьИдентификаторПрофиляГруппыДоступа();
	
	СсылкаПрофиль = Справочники.ПрофилиГруппДоступа.НайтиПоРеквизиту("ИдентификаторПоставляемыхДанных", ИдентификаторПрофиля);  
	Если СсылкаПрофиль.Пустая() Тогда
		ИдентификаторОбъектаМетаданныхРоль = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Роли.CW_РеестрыНДС0ИспользованиеСервиса);
		// создаем новый профиль доступа
		НовыйПрофиль = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
		НовыйПрофиль.Наименование = "Сервис ""Реестры НДС 0%""";
		НовыйПрофиль.Комментарий  = "Доступ к сервису ""Реестры НДС 0%"""; 
		НовыйПрофиль.ИдентификаторПоставляемыхДанных =  ИдентификаторПрофиля;
		
		НоваяСтрока 		= НовыйПрофиль.Роли.Добавить();
		НоваяСтрока.Роль 	= ИдентификаторОбъектаМетаданныхРоль; 
		
		СтрокаНазначение = НовыйПрофиль.Назначение.Добавить();
		СтрокаНазначение.ТипПользователей = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		
		НовыйПрофиль.Записать(); 
		
		СсылкаПрофиль = НовыйПрофиль.Ссылка;
		
	КонецЕсли; 
	
	Возврат СсылкаПрофиль;
	
КонецФункции

Процедура ПолучитьШаблоныТекстовHTTPЗапросов(Результат) Экспорт
	
	Результат.Вставить("vat_vatused",		"/%1/hs/vat/vatused");
	Результат.Вставить("vat_vatactivation",	"/%1/hs/vat/vatactivation");   
	Результат.Вставить("vat_vatdisable",	"/%1/hs/vat/vatdisable");  
	Результат.Вставить("vat_vatreginfo",	"/%1/hs/vat/vatreginfo");  
	Результат.Вставить("vat_rates",			"/%1/hs/vat/rates");  
	Результат.Вставить("vat_vatinfo",		"/%1/hs/vat/vatinfo");
	Результат.Вставить("vat_autoinvoice",	"/%1/hs/vat/autoinvoice");
	
КонецПроцедуры         

Функция ВыполнитьНастройкиМониторинговыхПарамтеров() Экспорт
	
	Возврат	ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ВыполнитьНастройкиМониторинговыхПарамтеров();
	
КонецФункции      

Процедура ПолучитьСчетНаПродлениеПодписки(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("software",		XMLСтрока(ПараметрыПроцедуры.ПрограммныйПродукт));
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(ПараметрыПроцедуры.РегистрационныйНомер));
	СтруктураJSON.Вставить("rateid",		XMLСтрока(ПараметрыПроцедуры.ИдентифкаторТарифа));
	СтруктураJSON.Вставить("startdate",		XMLСтрока(ПараметрыПроцедуры.ДатаНачала));
	СтруктураJSON.Вставить("months",		XMLСтрока(ПараметрыПроцедуры.КоличествоМесяцев));	
	СтруктураJSON.Вставить("count",			XMLСтрока(ПараметрыПроцедуры.Количество));	
	СтруктураJSON.Вставить("email",			XMLСтрока(ПараметрыПроцедуры.АдресПолучателя));

	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_paymentinvoice", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	Иначе
		КодСостояния	= Ответ.КодСостояния;
		ТекстСостояния 	= Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",	КодСостояния);
	СтруктураОтвета.Вставить("ТекстСостояния",	ТекстСостояния);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
	
КонецПроцедуры

Функция ПолучитьРегистрационнуюИнформациюСервиса() Экспорт
	
	СтруктураОтвет 			= Новый Структура;
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("service",	"РеестрыНДС0");
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("vat_vatreginfo", СтруктураJSON);
	
	Если ПараметрыHTTPЗапроса.УказаныРегистрационныеДанные Тогда
		
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
		
		Если Ответ = Неопределено Тогда 
			ЗаписьЖурналаРегистрации("Реестры НДС 0%", УровеньЖурналаРегистрации.Ошибка,,,"Отсутствует интернет-соединение!",);
		Иначе
			
			Сообщение = Ответ.ПолучитьТелокакСтроку();
			
			Если Ответ.КодСостояния <> 200 Тогда    
				Если ПустаяСтрока(Сообщение) Тогда
					ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
					Сообщение = "Код ошибки: "+ Ответ.КодСостояния +" - "+ ОписаниеКодовСостояний.Получить(Ответ.КодСостояния); 
				КонецЕсли;  
				ЗаписьЖурналаРегистрации("Реестры НДС 0%", УровеньЖурналаРегистрации.Ошибка,,,Сообщение,);
			Иначе
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(Сообщение);  
				
				СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
				ЧтениеJSON.Закрыть(); 
				
				СтруктураОтвет.Вставить("ДатаНачала", 		XMLЗначение(Тип("Дата"),	СтруктураJSON.ДатаНачала));
				СтруктураОтвет.Вставить("ДатаОкончания", 	XMLЗначение(Тип("Дата"),	СтруктураJSON.ДатаОкончания));
				СтруктураОтвет.Вставить("РегНомер",			XMLЗначение(Тип("Строка"),	СтруктураJSON.РегНомер));	
				СтруктураОтвет.Вставить("НазваниеКомпании",	XMLЗначение(Тип("Строка"),	СтруктураJSON.НазваниеКомпании));	
				СтруктураОтвет.Вставить("ТекущийТариф",		XMLЗначение(Тип("Строка"),	СтруктураJSON.ТекущийТариф));	
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураОтвет;
		
КонецФункции

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Форма.ИспользуетсяСервисРеестрНДС = ПолучитьФункциональнуюОпцию("CW_РеестрыНДС0Используется");
	
КонецПроцедуры

Процедура УстановитьПоказыватьРекламуПриСтартеПользователя(ЗначениеФлага, ИмяПользователя = Неопределено) Экспорт

	КлючОбъекта = ВРег("CW_РеестрыНДС0ПоказРекламы");
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "", ЗначениеФлага,, ИмяПользователя);

КонецПроцедуры

Функция ПоказыватьРекламуПриСтартеПользователя(ИмяПользователя = Неопределено) Экспорт

	КлючОбъекта = ВРег("CW_РеестрыНДС0ПоказРекламы");

	Результат = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,"",, ИмяПользователя);
	
	Если ТипЗнч(Результат) <> Тип("Булево") Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьНастройкуПоказаРекламы(ИмяПользователя = Неопределено) Экспорт
	
	КлючОбъекта = ВРег("CW_РеестрыНДС0ПоказРекламы");

	ХранилищеОбщихНастроек.Удалить(КлючОбъекта,"", ИмяПользователя);
	
КонецПроцедуры

Функция ПоказатьРекламныйБаннерВДокументе(Форма) Экспорт
	
	ПоказатьРекламныйБаннерВДокументе = ПараметрыСеанса.CW_РеестрыНДС0_ПоказатьРекламныйБаннерВДокументе;
	Если Не ПоказатьРекламныйБаннерВДокументе Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("СтавкаНДС", ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"));
	
	мСтроки = Форма.Объект.Услуги.НайтиСтроки(ОтборСтрок);
	
	Возврат мСтроки.Количество() > 0 и Форма.Объект.ФормируетсяАкт;
	
КонецФункции


Процедура УстановитьПараметрСеансаРеестрыНДС0(ЗначениеПараметра) Экспорт
	
	ПараметрыСеанса.CW_РеестрыНДС0_ПоказатьРекламныйБаннерВДокументе = ЗначениеПараметра;
	
КонецПроцедуры

Процедура УстановитьСписокВыбораПриложения(Форма, ИспользоватьРеквизитыФормы = Ложь) Экспорт 
	                  
	Если ИспользоватьРеквизитыФормы Тогда
		Приказ = Форма["Приказ"];	
	Иначе
		Приказ = Форма.Объект.Приказ;
	КонецЕсли;
	
	СписокВыбора 		= ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПолучитьСписокПриложенийПоПриказу(Приказ);
	МассивПриложений 	= СписокВыбора.ВыгрузитьЗначения();
	
	Форма.Элементы.ПриложениеПриказа.СписокВыбора.ЗагрузитьЗначения(МассивПриложений);
	
КонецПроцедуры  

Функция ПолучитьСписокВыбораВидаТранспортаПоПриказу(Приказ) Экспорт 
	                  
	Возврат ПланыВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений.ПолучитьСписокВидовТранспортаПоПриказу(Приказ);
	
КонецФункции    

Функция ПолучитьПриложениеПриказа(Знач Приказ, Знач ВидТранспорта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_РеестрыНДС0ЯчейкиПриложений.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.CW_РеестрыНДС0ЯчейкиПриложений КАК CW_РеестрыНДС0ЯчейкиПриложений
	|ГДЕ
	|	CW_РеестрыНДС0ЯчейкиПриложений.ЭтоГруппа = ИСТИНА
	|	И CW_РеестрыНДС0ЯчейкиПриложений.ПриложениеПоВидуТранспорта = &ВидТранспорта
	|	И CW_РеестрыНДС0ЯчейкиПриложений.Родитель = &ПриказФНС";  
	
	Запрос.УстановитьПараметр("ПриказФНС", 		Приказ);
	Запрос.УстановитьПараметр("ВидТранспорта", 	ВидТранспорта); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции


Функция ПолучитьДокументРеализации(ДокументДоходов) Экспорт
	
	Если ДокументДоходов.Корректировка Тогда
		Возврат	ПолучитьДокументРеализации(ДокументДоходов.КорректируемыйДокумент);
	КонецЕсли; 
	
	Возврат ДокументДоходов.ВедомыйДокумент;
	
КонецФункции

Функция ПолучитьПредопредленноеЗначениеРекввизита(РеквизитИмя, ЗначениеПоУмолчанию) Экспорт
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции


Процедура МониторПоддержкиПолучитьИнформацию(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	СервисИспользуется = Константы.CW_РеестрыНДС0Используется.Получить();
	
	СтруктураРеестрыНДС0 = Новый Структура;
	СтруктураРеестрыНДС0.Вставить("Используется",   			СервисИспользуется); 
	СтруктураРеестрыНДС0.Вставить("Ошибка", 					Ложь);	
	СтруктураРеестрыНДС0.Вставить("СоответствуетМинимальной", 	Ложь);	
	СтруктураРеестрыНДС0.Вставить("ИгнорироватьМинимальнуюВерсию", 		Ложь);	
	СтруктураРеестрыНДС0.Вставить("ИгнорироватьРекомендуемуюВервсию", 	Ложь);	
	СтруктураРеестрыНДС0.Вставить("МинимальнаяВерсия", 				"<...>");	
	СтруктураРеестрыНДС0.Вставить("РекомендуемаяВерсия", 			"<...>");	
	СтруктураРеестрыНДС0.Вставить("Тариф", 							"<...>");	
	СтруктураРеестрыНДС0.Вставить("ДатаНачала", 					"<...>");	
	СтруктураРеестрыНДС0.Вставить("ДатаОкончания", 					"<...>");	
	СтруктураРеестрыНДС0.Вставить("АвтоматическиВыписыватьСчета",	Ложь); 
	
	Если СервисИспользуется Тогда
		Результат = СведенияСервисеРеестрыНДС0();
		
		Если Результат = Неопределено или Результат.КодСостояния <> 200 Тогда
			СтруктураРеестрыНДС0.Вставить("Ошибка", Истина);
		Иначе
			СтруктураРеестрыНДС0.Вставить("МинимальнаяВерсия", 			Результат.МинимальнаяВерсия);	
			СтруктураРеестрыНДС0.Вставить("РекомендуемаяВерсия", 		Результат.РекомендуемаяВерсия);	
			СтруктураРеестрыНДС0.Вставить("СоответствуетМинимальной", 	Результат.СоответствуетМинимальной);	
			СтруктураРеестрыНДС0.Вставить("ИгнорироватьМинимальнуюВерсию", 		Результат.ИгнорироватьМинимальнуюВерсию);	
			СтруктураРеестрыНДС0.Вставить("ИгнорироватьРекомендуемуюВервсию", 	Результат.ИгнорироватьРекомендуемуюВервсию);	
			СтруктураРеестрыНДС0.Вставить("АвтоматическиВыписыватьСчета", 		Результат.АвтоматическиВыписыватьСчета);	
			
			СтруктураРеестрыНДС0.Вставить("Тариф", 			Результат.Тариф);	
			СтруктураРеестрыНДС0.Вставить("ДатаНачала", 	Результат.ДатаНачала);	
			СтруктураРеестрыНДС0.Вставить("ДатаОкончания", 	Результат.ДатаОкончания);	
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СтруктураРеестрыНДС0, АдресРезультата);
	
КонецПроцедуры


Функция СведенияСервисеРеестрыНДС0() Экспорт
	
	Результат = Новый Структура;   
	Результат.Вставить("КодСостояния",				Неопределено);
	Результат.Вставить("МинимальнаяВерсия",			"<...>"); 
	Результат.Вставить("РекомендуемаяВерсия",		"<...>"); 
	Результат.Вставить("Тариф",			 			"<...>"); 
	Результат.Вставить("ДатаНачала",				"<...>"); 
	Результат.Вставить("ДатаОкончания",	 			"<...>"); 
 	Результат.Вставить("Состояние",	 				"<...>"); 
	Результат.Вставить("СоответствуетМинимальной",			Ложь); 
    Результат.Вставить("ИгнорироватьМинимальнуюВерсию",		Ложь); 
	Результат.Вставить("ИгнорироватьРекомендуемуюВервсию",	Ложь); 
	Результат.Вставить("АвтоматическиВыписыватьСчета",		Ложь); 

	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	Если ПустаяСтрока(РегистрационныйНомер) Тогда
		Результат.Вставить("КодСостояния",	403);
		Результат.Вставить("Состояние",		"Программный продукт не зарегистрирован!");
		Возврат Результат;
	КонецЕсли;
	
	versionaf = CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы(); 
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("versionaf",	XMLСтрока(versionaf));
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер)); 

	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("vat_vatinfo", СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("КодСостояния", Ответ.КодСостояния);
	
	Если Ответ.КодСостояния = 200 Тогда
		
		Тело = Ответ.ПолучитьТелоКакСтроку();  
		
		СтруктураОтветJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
		
		Результат.Вставить("МинимальнаяВерсия",			XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.minversionaf)); 
		Результат.Вставить("РекомендуемаяВерсия",		XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.recversionaf)); 
		Результат.Вставить("Тариф",			 			XMLЗначение(тип("Строка"), 	СтруктураОтветJSON.rate)); 
		Результат.Вставить("ДатаНачала",				XMLЗначение(тип("Дата"), 	СтруктураОтветJSON.startdate)); 
		Результат.Вставить("ДатаОкончания",	 			XMLЗначение(тип("Дата"), 	СтруктураОтветJSON.enddate)); 
		Результат.Вставить("СоответствуетМинимальной",	XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.respondmin)); 
		
		Результат.Вставить("ИгнорироватьМинимальнуюВерсию",		XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.ignoreminversionaf));	
		Результат.Вставить("ИгнорироватьРекомендуемуюВервсию", 	XMLЗначение(тип("Булево"), 	СтруктураОтветJSON.ignorerecversionaf));	
		Результат.Вставить("АвтоматическиВыписыватьСчета", 		XMLЗначение(Тип("Булево"),	СтруктураОтветJSON.autoinvoice));  
		
	КонецЕсли;
	
	Возврат Результат;   
	
КонецФункции


Процедура ОбновитьДанныеАвтоматическойВыпискиСчетов(ПараметрыПроцедуры, АдресРезультата) Экспорт

	Результат = Новый Структура;
	
	СервисИспользуется = Константы.CW_РеестрыНДС0Используется.Получить();
	
	Если СервисИспользуется Тогда 
		
		РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
		Если ПустаяСтрока(РегистрационныйНомер) Тогда
			Результат.Вставить("КодСостояния",	403);
			Результат.Вставить("Состояние",		"Программный продукт не зарегистрирован!");
		Иначе
			
			versionaf = CW_ОбновлениеКонфигурацииСервер.УстановленнаяВерсияПодсистемы(); 
			
			СтруктураJSON = Новый Структура;
			СтруктураJSON.Вставить("regnumber",		XMLСтрока(РегистрационныйНомер)); 
			СтруктураJSON.Вставить("autoinvoice",	XMLСтрока(ПараметрыПроцедуры.Значение)); 
			
			ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("vat_autoinvoice", СтруктураJSON);
			
			Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");
			Результат.Вставить("КодСостояния", 	Ответ.КодСостояния);
			Результат.Вставить("Состояние", 	Ответ.ПолучитьтелоКакСтроку());
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры
